---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorReferenceIndex
source: html/ab524e38-240d-a5f9-64dc-d86c446ab4ff.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorReferenceIndex Property

"Link Connector Index"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorReferenceIndex { get; }
```